In [22]:
import pandas as pd
import numpy as np

In [23]:
student_perfomance = pd.read_csv("StepikDS/StudentsPerformance.csv")

In [24]:
student_perfomance.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [40]:
student_perfomance.loc[:7]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92
7,male,group B,some college,free/reduced,none,40,43,39

In [49]:
student_perfomance.size

8000

In [32]:
student_perfomance_with_names = student_perfomance.iloc[[0,3,4,7,8]]

In [33]:
student_perfomance_with_names.index = ["Cergey","Petr","Victor","Semen","Tigr"]

In [34]:
student_perfomance_with_names

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
Cergey,female,group B,bachelor's degree,standard,none,72,72,74
Petr,male,group A,associate's degree,free/reduced,none,47,57,44
Victor,male,group C,some college,standard,none,76,78,75
Semen,male,group B,some college,free/reduced,none,40,43,39
Tigr,male,group D,high school,free/reduced,completed,64,64,67

In [36]:
student_perfomance_with_names.loc[['Cergey','Cergey'],['gender','writing score']]

        gender  writing score
Cergey  female             74
Cergey  female             74

In [ ]:
# https://stepik.org/media/attachments/course/4852/titanic.csv

In [50]:
titanic_data = pd.read_csv('https://stepik.org/media/attachments/course/4852/titanic.csv')

In [51]:
titanic_data.shape

(891, 12)

In [52]:
titanic_data.size

10692

In [54]:
titanic_data.dtypes.value_counts()

object     5
int64      5
float64    2
dtype: int64